# ДНК представляет собой последовательность (строку) из чередований четырёх молекул (букв):
# аденин (A),
# цитозин (C),
# гуанин (G),
# тимин (T).
# РНК же состоит из чередований:
# аденина (A),
# цитозина (C),
# гуанина (G)
# урацила (U).
# При транскрипции ДНК в РНК, аденин переходит в урацил,
# цитозин - в гуанин, гуанин - в цитозин, тимин - в аденин.
# Ваша задача написать функцию, которая по последовательности ДНК
# (например, 'AGCTAT') вычисляет последовательность РНК (соответственно 'UCGAUA').
def to_rna(x):
    answer = ''
    answer += x.replace("A", "U").replace("G", "1").replace("C", "G").replace("T", "A").replace("1", "C")
    return answer
